# Exercise 4.9 - Part 1

## Table of Contents:

#### 01. Importing libraries and Data
#### 02. New Data Set Work

## 01. Import Libraries and Data

In [1]:
# Import Libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Import Data

path = r'C:\Users\Rebecca\Instacart Basket Analysis'

In [3]:
path

'C:\\Users\\Rebecca\\Instacart Basket Analysis'

In [4]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'df_ords_prods_merge.pkl'))

In [5]:
# Import new customer data set

df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

## 02. New Data Set Work

01. Data Checks

In [6]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
df_cust.tail()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [6]:
df_cust.shape

(206209, 10)

In [10]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [11]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 25 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int32
 1   user_id                        int32
 2   order_number                   int8
 3   orders_day_of_week             int8
 4   order_hour_of_day              int8
 5   days_since_prior_order         float16
 6   product_id                     int32
 7   add_to_cart_order              int32
 8   reordered                      int8
 9   _merge                         category
 10  product_name                   object
 11  aisle_id                       int8
 12  department_id                  int8
 13  prices                         float32
 14  source                         category
 15  price_range_loc                object
 16  busiest_day                    object
 17  busiest_days_breakdown         object
 18  busiest_period_of_day          object
 19  max_order                      int8
 20  loyalty_flag                   object
 21  average_spend_price            float32
 22  spender_type                   object
 23  average_days_since_last_order  float16
 24  order_frequency_flag           object
dtypes: category(2), float16(2), float32(2), int32(4), int8(7), object(8)
memory usage: 3.0+ GB

In [13]:
df_cust['First Name'].value_counts(dropna = False)

First Name
NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

02. Wrangling

In [15]:
# Renaming customer columns to be consistent 

df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [16]:
df_cust.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [17]:
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [18]:
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [19]:
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [20]:
df_cust.rename(columns = {'n_dependants' : 'dependants'}, inplace = True)

In [21]:
df_cust.rename(columns = {'fam_status' : 'family_status'}, inplace = True)

In [23]:
# Checking updated columns 

df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  int64
 1   first_name     194950 non-null  object
 2   last_name      206209 non-null  object
 3   gender         206209 non-null  object
 4   state          206209 non-null  object
 5   age            206209 non-null  int64
 6   date_joined    206209 non-null  object
 7   dependants     206209 non-null  int64
 8   family_status  206209 non-null  object
 9   income         206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [25]:
# Changing variable's data type

df_cust['user_id'] = df_cust['user_id'].astype('int32')

In [26]:
df_cust['age'] = df_cust['age'].astype('int32')

In [27]:
df_cust['dependants'] = df_cust['dependants'].astype('int32')

In [29]:
df_cust['income'] = df_cust['income'].astype('int32')

In [30]:
# Checking updated variables 

df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  int32
 1   first_name     194950 non-null  object
 2   last_name      206209 non-null  object
 3   gender         206209 non-null  object
 4   state          206209 non-null  object
 5   age            206209 non-null  int32
 6   date_joined    206209 non-null  object
 7   dependants     206209 non-null  int32
 8   family_status  206209 non-null  object
 9   income         206209 non-null  int32
dtypes: int32(4), object(6)
memory usage: 12.6+ MB

03. Consistency Checks

In [35]:
# Checking for mixed types

for col in df_cust.columns:
    types = df_cust[col].apply(type)
    if types.nunique() > 1:
        print(f"Column '{col}' has mixed types: {types.unique()}")

Column 'first_name' has mixed types: [<class 'str'> <class 'float'>]

In [36]:
# Changing the first name field to a string

df_cust['first_name'] = df_cust['first_name'].astype('str')

In [37]:
# Checking update

df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  int32
 1   first_name     206209 non-null  object
 2   last_name      206209 non-null  object
 3   gender         206209 non-null  object
 4   state          206209 non-null  object
 5   age            206209 non-null  int32
 6   date_joined    206209 non-null  object
 7   dependants     206209 non-null  int32
 8   family_status  206209 non-null  object
 9   income         206209 non-null  int32
dtypes: int32(4), object(6)
memory usage: 12.6+ MB

In [38]:
# Checking null values

df_cust.isnull().sum()

user_id          0
first_name       0
last_name        0
gender           0
state            0
age              0
date_joined      0
dependants       0
family_status    0
income           0
dtype: int64

In [39]:
df_nan = df_cust[df_cust['first_name'].isnull() == True]

In [40]:
df_nan

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, dependants, family_status, income]
Index: []

In [42]:
df_cust.shape

(206209, 10)

In [43]:
# Checking for duplicates

df_dups = df_cust[df_cust.duplicated()]

In [44]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, dependants, family_status, income]
Index: []

04. Merging Data

In [45]:
df_cust.shape

(206209, 10)

In [46]:
ords_prods_merge.shape

(32404859, 25)

In [47]:
# Merging df_cust with df_cust with ords_prods_merge

df_ords_prods_cust_merge = ords_prods_merge.merge(df_cust, on = 'user_id', how='inner', indicator = 'True')

In [48]:
# Checking merged df

df_ords_prods_cust_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,first_name,last_name,gender,state,age,date_joined,dependants,family_status,income,True
0,2539329,1,1,2,8,NaN,196,1,0,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,NaN,14084,2,0,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,NaN,12427,3,0,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,NaN,26088,4,0,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,NaN,26405,5,0,both,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [49]:
df_ords_prods_cust_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [50]:
df_ords_prods_cust_merge.shape

(32404859, 35)

In [51]:
df_ords_prods_cust_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 35 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int32
 1   user_id                        int32
 2   order_number                   int8
 3   orders_day_of_week             int8
 4   order_hour_of_day              int8
 5   days_since_prior_order         float16
 6   product_id                     int32
 7   add_to_cart_order              int32
 8   reordered                      int8
 9   _merge                         category
 10  product_name                   object
 11  aisle_id                       int8
 12  department_id                  int8
 13  prices                         float32
 14  source                         category
 15  price_range_loc                object
 16  busiest_day                    object
 17  busiest_days_breakdown         object
 18  busiest_period_of_day          object
 19  max_order                      int8
 20  loyalty_flag                   object
 21  average_spend_price            float32
 22  spender_type                   object
 23  average_days_since_last_order  float16
 24  order_frequency_flag           object
 25  first_name                     object
 26  last_name                      object
 27  gender                         object
 28  state                          object
 29  age                            int32
 30  date_joined                    object
 31  dependants                     int32
 32  family_status                  object
 33  income                         int32
 34  True                           category
dtypes: category(3), float16(2), float32(2), int32(7), int8(7), object(14)
memory usage: 4.9+ GB

05. Exporting Data Sets

In [55]:
df_cust.to_csv(os.path.join(path, '02 Data','Prepared Data', 'customers_wrangled_cleaned.csv'))

In [56]:
df_ords_prods_cust_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_ords_prods_cust_merge.pkl'))